tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1507_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16F1507_H_
#define _PIC16F1507_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define RA0                           36
#define RA1                           37
#define RA2                           38
#define RA3                           39
#define RA4                           40
#define RA5                           41
#define PORTB                         42
#define RB4                           43
#define RB5                           44
#define RB6                           45
#define RB7                           46
#define PORTC                         47
#define RC0                           48
#define RC1                           49
#define RC2                           50
#define RC3                           51
#define RC4                           52
#define RC5                           53
#define RC6                           54
#define RC7                           55
#define PIR1                          56
#define TMR1IF                        57
#define TMR2IF                        58
#define ADIF                          59
#define TMR1GIF                       60
#define PIR2                          61
#define NCO1IF                        62
#define PIR3                          63
#define CLC1IF                        64
#define CLC2IF                        65
#define TMR0                          66
#define TMR1L                         67
#define TMR1H                         68
#define T1CON                         69
#define TMR1ON                        70
#define nT1SYNC                       71
#define T1OSCEN                       72
#define T1CKPS0                       73
#define T1CKPS                        74
#define T1CKPS1                       75
#define TMR1CS0                       76
#define TMR1CS                        77
#define TMR1CS1                       78
#define T1GCON                        79
#define T1GSS0                        80
#define T1GSS                         81
#define T1GSS1                        82
#define T1GVAL                        83
#define T1GGO_nDONE                   84
#define T1GSPM                        85
#define T1GTM                         86
#define T1GPOL                        87
#define TMR1GE                        88
#define TMR2                          89
#define PR2                           90
#define T2CON                         91
#define T2CKPS0                       92
#define T2CKPS                        93
#define T2CKPS1                       94
#define TMR2ON                        95
#define TOUTPS0                       96
#define T2OUTPS                       97
#define TOUTPS1                       98
#define TOUTPS2                       99
#define TOUTPS3                       100
#define TRISA                         101
#define TRISA0                        102
#define TRISA1                        103
#define TRISA2                        104
#define TRISA3                        105
#define TRISA4                        106
#define TRISA5                        107
#define TRISB                         108
#define TRISB4                        109
#define TRISB5                        110
#define TRISB6                        111
#define TRISB7                        112
#define TRISC                         113
#define TRISC0                        114
#define TRISC1                        115
#define TRISC2                        116
#define TRISC3                        117
#define TRISC4                        118
#define TRISC5                        119
#define TRISC6                        120
#define TRISC7                        121
#define PIE1                          122
#define TMR1IE                        123
#define TMR2IE                        124
#define ADIE                          125
#define TMR1GIE                       126
#define PIE2                          127
#define NCO1IE                        128
#define PIE3                          129
#define CLC1IE                        130
#define CLC2IE                        131
#define OPTION_REG                    132
#define PS                            133
#define PS0                           134
#define PS1                           135
#define PS2                           136
#define PSA                           137
#define T0SE                          138
#define TMR0SE                        139
#define T0CS                          140
#define TMR0CS                        141
#define INTEDG                        142
#define nWPUEN                        143
#define PCON                          144
#define nBOR                          145
#define nPOR                          146
#define nRI                           147
#define nRMCLR                        148
#define nRWDT                         149
#define STKUNF                        150
#define STKOVF                        151
#define WDTCON                        152
#define SWDTEN                        153
#define WDTPS                         154
#define WDTPS0                        155
#define WDTPS1                        156
#define WDTPS2                        157
#define WDTPS3                        158
#define WDTPS4                        159
#define OSCCON                        160
#define SCS0                          161
#define SCS                           162
#define SCS1                          163
#define IRCF                          164
#define IRCF0                         165
#define IRCF1                         166
#define IRCF2                         167
#define IRCF3                         168
#define OSCSTAT                       169
#define HFIOFS                        170
#define LFIOFR                        171
#define HFIOFR                        172
#define OSTS                          173
#define SOSCR                         174
#define ADRESL                        175
#define ADRESH                        176
#define ADCON0                        177
#define ADON                          178
#define GO_nDONE                      179
#define GO                            180
#define ADGO                          181
#define CHS0                          182
#define CHS                           183
#define CHS1                          184
#define CHS2                          185
#define CHS3                          186
#define CHS4                          187
#define ADCON1                        188
#define ADPREF0                       189
#define ADPREF                        190
#define ADPREF1                       191
#define ADCS0                         192
#define ADCS                          193
#define ADCS1                         194
#define ADCS2                         195
#define ADFM                          196
#define ADCON2                        197
#define TRIGSEL                       198
#define TRIGSEL0                      199
#define TRIGSEL1                      200
#define TRIGSEL2                      201
#define TRIGSEL3                      202
#define LATA                          203
#define LATA0                         204
#define LATA1                         205
#define LATA2                         206
#define LATA4                         207
#define LATA5                         208
#define LATB                          209
#define LATB4                         210
#define LATB5                         211
#define LATB6                         212
#define LATB7                         213
#define LATC                          214
#define LATC0                         215
#define LATC1                         216
#define LATC2                         217
#define LATC3                         218
#define LATC4                         219
#define LATC5                         220
#define LATC6                         221
#define LATC7                         222
#define BORCON                        223
#define BORRDY                        224
#define BORFS                         225
#define SBOREN                        226
#define FVRCON                        227
#define ADFVR0                        228
#define ADFVR                         229
#define ADFVR1                        230
#define TSRNG                         231
#define TSEN                          232
#define FVRRDY                        233
#define FVREN                         234
#define APFCON                        235
#define NCO1SEL                       236
#define CLC1SEL                       237
#define ANSA0                         238
#define ANSELA                        239
#define ANSA1                         240
#define ANSA2                         241
#define ANSA4                         242
#define ANSELB                        243
#define ANSB4                         244
#define ANSB5                         245
#define ANSC0                         246
#define ANSELC                        247
#define ANSC1                         248
#define ANSC2                         249
#define ANSC3                         250
#define ANSC6                         251
#define ANSC7                         252
#define PMADRL                        253
#define PMADRH                        254
#define PMDATL                        255
#define PMDATH                        256
#define PMCON1                        257
#define RD                            258
#define WR                            259
#define WREN                          260
#define WRERR                         261
#define FREE                          262
#define LWLO                          263
#define CFGS                          264
#define PMCON2                        265
#define VREGCON                       266
#define VREGPM0                       267
#define VREGPM                        268
#define VREGPM1                       269
#define WPUA0                         270
#define WPUA                          271
#define WPUA1                         272
#define WPUA2                         273
#define WPUA3                         274
#define WPUA4                         275
#define WPUA5                         276
#define WPUB                          277
#define WPUB4                         278
#define WPUB5                         279
#define WPUB6                         280
#define WPUB7                         281
#define IOCAP                         282
#define IOCAP0                        283
#define IOCAP1                        284
#define IOCAP2                        285
#define IOCAP3                        286
#define IOCAP4                        287
#define IOCAP5                        288
#define IOCAN0                        289
#define IOCAN                         290
#define IOCAN1                        291
#define IOCAN2                        292
#define IOCAN3                        293
#define IOCAN4                        294
#define IOCAN5                        295
#define IOCAF0                        296
#define IOCAF                         297
#define IOCAF1                        298
#define IOCAF2                        299
#define IOCAF3                        300
#define IOCAF4                        301
#define IOCAF5                        302
#define IOCBP                         303
#define IOCBP4                        304
#define IOCBP5                        305
#define IOCBP6                        306
#define IOCBP7                        307
#define IOCBN4                        308
#define IOCBN                         309
#define IOCBN5                        310
#define IOCBN6                        311
#define IOCBN7                        312
#define IOCBF4                        313
#define IOCBF                         314
#define IOCBF5                        315
#define IOCBF6                        316
#define IOCBF7                        317
#define NCO1ACCL                      318
#define NCO1ACC0                      319
#define NCO1ACC1                      320
#define NCO1ACC2                      321
#define NCO1ACC3                      322
#define NCO1ACC4                      323
#define NCO1ACC5                      324
#define NCO1ACC6                      325
#define NCO1ACC7                      326
#define NCO1ACCH                      327
#define NCO1ACC8                      328
#define NCO1ACC9                      329
#define NCO1ACC10                     330
#define NCO1ACC11                     331
#define NCO1ACC12                     332
#define NCO1ACC13                     333
#define NCO1ACC14                     334
#define NCO1ACC15                     335
#define NCO1ACCU                      336
#define NCO1ACC16                     337
#define NCO1ACC17                     338
#define NCO1ACC18                     339
#define NCO1ACC19                     340
#define NCO1INCL                      341
#define NCO1INC0                      342
#define NCO1INC1                      343
#define NCO1INC2                      344
#define NCO1INC3                      345
#define NCO1INC4                      346
#define NCO1INC5                      347
#define NCO1INC6                      348
#define NCO1INC7                      349
#define NCO1INCH                      350
#define NCO1INC8                      351
#define NCO1INC9                      352
#define NCO1INC10                     353
#define NCO1INC11                     354
#define NCO1INC12                     355
#define NCO1INC13                     356
#define NCO1INC14                     357
#define NCO1INC15                     358
#define NCO1CON                       359
#define N1PFM                         360
#define N1POL                         361
#define N1OUT                         362
#define N1OE                          363
#define N1EN                          364
#define NCO1CLK                       365
#define N1CKS                         366
#define N1CKS0                        367
#define N1CKS1                        368
#define N1PWS0                        369
#define N1PWS                         370
#define N1PWS1                        371
#define N1PWS2                        372
#define PWM1DCL                       373
#define PWM1DCL0                      374
#define PWM1DCL1                      375
#define PWM1DCH                       376
#define PWM1DCH0                      377
#define PWM1DCH1                      378
#define PWM1DCH2                      379
#define PWM1DCH3                      380
#define PWM1DCH4                      381
#define PWM1DCH5                      382
#define PWM1DCH6                      383
#define PWM1DCH7                      384
#define PWM1CON                       385
#define PWM1POL                       386
#define PWM1OUT                       387
#define PWM1OE                        388
#define PWM1EN                        389
#define PWM2DCL0                      390
#define PWM2DCL                       391
#define PWM2DCL1                      392
#define PWM2DCH0                      393
#define PWM2DCH                       394
#define PWM2DCH1                      395
#define PWM2DCH2                      396
#define PWM2DCH3                      397
#define PWM2DCH4                      398
#define PWM2DCH5                      399
#define PWM2DCH6                      400
#define PWM2DCH7                      401
#define PWM2CON                       402
#define PWM2POL                       403
#define PWM2OUT                       404
#define PWM2OE                        405
#define PWM2EN                        406
#define PWM3DCL0                      407
#define PWM3DCL                       408
#define PWM3DCL1                      409
#define PWM3DCH0                      410
#define PWM3DCH                       411
#define PWM3DCH1                      412
#define PWM3DCH2                      413
#define PWM3DCH3                      414
#define PWM3DCH4                      415
#define PWM3DCH5                      416
#define PWM3DCH6                      417
#define PWM3DCH7                      418
#define PWM3CON                       419
#define PWM3POL                       420
#define PWM3OUT                       421
#define PWM3OE                        422
#define PWM3EN                        423
#define PWM4DCL                       424
#define PWM4DCL0                      425
#define PWM4DCL1                      426
#define PWM4DCH0                      427
#define PWM4DCH                       428
#define PWM4DCH1                      429
#define PWM4DCH2                      430
#define PWM4DCH3                      431
#define PWM4DCH4                      432
#define PWM4DCH5                      433
#define PWM4DCH6                      434
#define PWM4DCH7                      435
#define PWM4CON                       436
#define PWM4POL                       437
#define PWM4OUT                       438
#define PWM4OE                        439
#define PWM4EN                        440
#define CWG1DBR0                      441
#define CWG1DBR                       442
#define CWG1DBR1                      443
#define CWG1DBR2                      444
#define CWG1DBR3                      445
#define CWG1DBR4                      446
#define CWG1DBR5                      447
#define CWG1DBF                       448
#define CWG1DBF0                      449
#define CWG1DBF1                      450
#define CWG1DBF2                      451
#define CWG1DBF3                      452
#define CWG1DBF4                      453
#define CWG1DBF5                      454
#define CWG1CON0                      455
#define G1CS0                         456
#define G1CS                          457
#define G1POLA                        458
#define G1POLB                        459
#define G1OEA                         460
#define G1OEB                         461
#define G1EN                          462
#define CWG1CON1                      463
#define G1IS0                         464
#define G1IS                          465
#define G1IS1                         466
#define G1IS2                         467
#define G1ASDLA                       468
#define G1ASDLA0                      469
#define G1ASDLA1                      470
#define G1ASDLB                       471
#define G1ASDLB0                      472
#define G1ASDLB1                      473
#define CWG1CON2                      474
#define G1ASDSCLC2                    475
#define G1ASDSFLT                     476
#define G1ARSEN                       477
#define G1ASE                         478
#define CLCDATA                       479
#define MCLC1OUT                      480
#define MCLC2OUT                      481
#define CLC1CON                       482
#define LC1MODE0                      483
#define LC1MODE                       484
#define CLC1CON_LCMODE0               485
#define LC1MODE1                      486
#define CLC1CON_LCMODE1               487
#define CLC1CON_LCMODE2               488
#define LC1MODE2                      489
#define LC1INTN                       490
#define CLC1CON_LCINTN                491
#define LC1INTP                       492
#define CLC1CON_LCINTP                493
#define CLC1CON_LCOUT                 494
#define LC1OUT                        495
#define LC1OE                         496
#define CLC1CON_LCOE                  497
#define LC1EN                         498
#define CLC1CON_LCEN                  499
#define CLC1POL                       500
#define LC1G1POL                      501
#define CLC1POL_G1POL                 502
#define CLC1POL_G2POL                 503
#define LC1G2POL                      504
#define LC1G3POL                      505
#define CLC1POL_G3POL                 506
#define LC1G4POL                      507
#define CLC1POL_G4POL                 508
#define CLC1POL_POL                   509
#define LC1POL                        510
#define CLC1SEL0                      511
#define LC1D1S                        512
#define CLC1SEL0_D1S0                 513
#define LC1D1S0                       514
#define CLC1SEL0_D1S1                 515
#define LC1D1S1                       516
#define CLC1SEL0_D1S2                 517
#define LC1D1S2                       518
#define LC1D2S                        519
#define LC1D2S0                       520
#define CLC1SEL0_D2S0                 521
