tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1507_tdd.h
#define LC1D2S1                       522
#define CLC1SEL0_D2S1                 523
#define LC1D2S2                       524
#define CLC1SEL0_D2S2                 525
#define CLC1SEL1                      526
#define LC1D3S0                       527
#define CLC1SEL1_D3S0                 528
#define LC1D3S                        529
#define LC1D3S1                       530
#define CLC1SEL1_D3S1                 531
#define LC1D3S2                       532
#define CLC1SEL1_D3S2                 533
#define LC1D4S                        534
#define LC1D4S0                       535
#define CLC1SEL1_D4S0                 536
#define LC1D4S1                       537
#define CLC1SEL1_D4S1                 538
#define LC1D4S2                       539
#define CLC1SEL1_D4S2                 540
#define CLC1GLS0                      541
#define CLC1GLS0_D1N                  542
#define LC1G1D1N                      543
#define CLC1GLS0_D1T                  544
#define LC1G1D1T                      545
#define LC1G1D2N                      546
#define CLC1GLS0_D2N                  547
#define LC1G1D2T                      548
#define CLC1GLS0_D2T                  549
#define CLC1GLS0_D3N                  550
#define LC1G1D3N                      551
#define CLC1GLS0_D3T                  552
#define LC1G1D3T                      553
#define CLC1GLS0_D4N                  554
#define LC1G1D4N                      555
#define CLC1GLS0_D4T                  556
#define LC1G1D4T                      557
#define CLC1GLS1                      558
#define CLC1GLS1_D1N                  559
#define LC1G2D1N                      560
#define LC1G2D1T                      561
#define CLC1GLS1_D1T                  562
#define CLC1GLS1_D2N                  563
#define LC1G2D2N                      564
#define LC1G2D2T                      565
#define CLC1GLS1_D2T                  566
#define CLC1GLS1_D3N                  567
#define LC1G2D3N                      568
#define LC1G2D3T                      569
#define CLC1GLS1_D3T                  570
#define CLC1GLS1_D4N                  571
#define LC1G2D4N                      572
#define LC1G2D4T                      573
#define CLC1GLS1_D4T                  574
#define CLC1GLS2                      575
#define CLC1GLS2_D1N                  576
#define LC1G3D1N                      577
#define LC1G3D1T                      578
#define CLC1GLS2_D1T                  579
#define LC1G3D2N                      580
#define CLC1GLS2_D2N                  581
#define LC1G3D2T                      582
#define CLC1GLS2_D2T                  583
#define CLC1GLS2_D3N                  584
#define LC1G3D3N                      585
#define LC1G3D3T                      586
#define CLC1GLS2_D3T                  587
#define LC1G3D4N                      588
#define CLC1GLS2_D4N                  589
#define LC1G3D4T                      590
#define CLC1GLS2_D4T                  591
#define CLC1GLS3                      592
#define LC1G4D1N                      593
#define CLC1GLS3_G4D1N                594
#define LC1G4D1T                      595
#define CLC1GLS3_G4D1T                596
#define CLC1GLS3_G4D2N                597
#define LC1G4D2N                      598
#define CLC1GLS3_G4D2T                599
#define LC1G4D2T                      600
#define LC1G4D3N                      601
#define CLC1GLS3_G4D3N                602
#define LC1G4D3T                      603
#define CLC1GLS3_G4D3T                604
#define CLC1GLS3_G4D4N                605
#define LC1G4D4N                      606
#define CLC1GLS3_G4D4T                607
#define LC1G4D4T                      608
#define CLC2CON                       609
#define LC2MODE0                      610
#define LC2MODE                       611
#define CLC2CON_LCMODE0               612
#define LC2MODE1                      613
#define CLC2CON_LCMODE1               614
#define LC2MODE2                      615
#define CLC2CON_LCMODE2               616
#define LC2INTN                       617
#define CLC2CON_LCINTN                618
#define LC2INTP                       619
#define CLC2CON_LCINTP                620
#define CLC2CON_LCOUT                 621
#define LC2OUT                        622
#define LC2OE                         623
#define CLC2CON_LCOE                  624
#define CLC2CON_LCEN                  625
#define LC2EN                         626
#define CLC2POL                       627
#define LC2G1POL                      628
#define CLC2POL_G1POL                 629
#define LC2G2POL                      630
#define CLC2POL_G2POL                 631
#define LC2G3POL                      632
#define CLC2POL_G3POL                 633
#define LC2G4POL                      634
#define CLC2POL_G4POL                 635
#define CLC2POL_POL                   636
#define LC2POL                        637
#define CLC2SEL0                      638
#define LC2D1S0                       639
#define CLC2SEL0_D1S0                 640
#define LC2D1S                        641
#define LC2D1S1                       642
#define CLC2SEL0_D1S1                 643
#define LC2D1S2                       644
#define CLC2SEL0_D1S2                 645
#define LC2D2S0                       646
#define LC2D2S                        647
#define CLC2SEL0_D2S0                 648
#define LC2D2S1                       649
#define CLC2SEL0_D2S1                 650
#define LC2D2S2                       651
#define CLC2SEL0_D2S2                 652
#define CLC2SEL1                      653
#define CLC2SEL1_D3S0                 654
#define LC2D3S0                       655
#define LC2D3S                        656
#define LC2D3S1                       657
#define CLC2SEL1_D3S1                 658
#define LC2D3S2                       659
#define CLC2SEL1_D3S2                 660
#define LC2D4S                        661
#define LC2D4S0                       662
#define CLC2SEL1_D4S0                 663
#define LC2D4S1                       664
#define CLC2SEL1_D4S1                 665
#define LC2D4S2                       666
#define CLC2SEL1_D4S2                 667
#define CLC2GLS0                      668
#define LC2G1D1N                      669
#define CLC2GLS0_D1N                  670
#define CLC2GLS0_D1T                  671
#define LC2G1D1T                      672
#define LC2G1D2N                      673
#define CLC2GLS0_D2N                  674
#define CLC2GLS0_D2T                  675
#define LC2G1D2T                      676
#define LC2G1D3N                      677
#define CLC2GLS0_D3N                  678
#define CLC2GLS0_D3T                  679
#define LC2G1D3T                      680
#define LC2G1D4N                      681
#define CLC2GLS0_D4N                  682
#define CLC2GLS0_D4T                  683
#define LC2G1D4T                      684
#define CLC2GLS1                      685
#define CLC2GLS1_D1N                  686
#define LC2G2D1N                      687
#define CLC2GLS1_D1T                  688
#define LC2G2D1T                      689
#define CLC2GLS1_D2N                  690
#define LC2G2D2N                      691
#define CLC2GLS1_D2T                  692
#define LC2G2D2T                      693
#define LC2G2D3N                      694
#define CLC2GLS1_D3N                  695
#define LC2G2D3T                      696
#define CLC2GLS1_D3T                  697
#define LC2G2D4N                      698
#define CLC2GLS1_D4N                  699
#define LC2G2D4T                      700
#define CLC2GLS1_D4T                  701
#define CLC2GLS2                      702
#define LC2G3D1N                      703
#define CLC2GLS2_D1N                  704
#define CLC2GLS2_D1T                  705
#define LC2G3D1T                      706
#define CLC2GLS2_D2N                  707
#define LC2G3D2N                      708
#define LC2G3D2T                      709
#define CLC2GLS2_D2T                  710
#define CLC2GLS2_D3N                  711
#define LC2G3D3N                      712
#define CLC2GLS2_D3T                  713
#define LC2G3D3T                      714
#define CLC2GLS2_D4N                  715
#define LC2G3D4N                      716
#define LC2G3D4T                      717
#define CLC2GLS2_D4T                  718
#define CLC2GLS3                      719
#define LC2G4D1N                      720
#define CLC2GLS3_G4D1N                721
#define CLC2GLS3_G4D1T                722
#define LC2G4D1T                      723
#define CLC2GLS3_G4D2N                724
#define LC2G4D2N                      725
#define LC2G4D2T                      726
#define CLC2GLS3_G4D2T                727
#define CLC2GLS3_G4D3N                728
#define LC2G4D3N                      729
#define CLC2GLS3_G4D3T                730
#define LC2G4D3T                      731
#define LC2G4D4N                      732
#define CLC2GLS3_G4D4N                733
#define CLC2GLS3_G4D4T                734
#define LC2G4D4T                      735
#define BSR_ICDSHAD                   736
#define STATUS_SHAD                   737
#define C_SHAD                        738
#define DC_SHAD                       739
#define Z_SHAD                        740
#define WREG_SHAD                     741
#define BSR_SHAD                      742
#define PCLATH_SHAD                   743
#define FSR0L_SHAD                    744
#define FSR0H_SHAD                    745
#define FSR1L_SHAD                    746
#define FSR1H_SHAD                    747
#define STKPTR                        748
#define TOSL                          749
#define TOSH                          750

#endif // _PIC16F1507_H_
